from datetime import datetime
import secrets
import random

def issued_hash():
    hex = secrets.token_hex(nbytes=16)
    return hex

def issued_token():
    token = secrets.token_hex(32)
    return token

def get_now():
    now = datetime.now()
    return now.date()

def make_nickname():
    fir_nm = [
    "강렬한", "화려한", "찬란한", "활기찬", "생기 넘치는",
    "부드러운", "매력적인", "우아한", "아름다운", "우아한",
    "진지한", "신중한", "심각한", "엄숙한", "조심스러운",
    "활발한", "에너지 넘치는", "열정적인", "드라이브가 있는", "경쾌한",
    "풍부한", "다채로운", "다양한", "풍성한", "풍요로운",
    "창의적인", "독창적인", "창조적인", "놀라운", "혁신적인",
    "포근한", "따뜻한", "온화한", "친근한", "애정 어린",
    "당당한", "자신감 있는", "담대한", "용감한", "끈질긴",
    "유쾌한", "쾌활한", "즐거운", "유머러스한", "웃긴",
    "근면한", "성실한", "헌신적인", "노력하는", "열심히 일하는",
    "화려한", "밝은", "신비로운", "환상적인", "매혹적인", "도전적인",
    "풍부한", "아쉬운", "감동적인", "최고의", "낭만적인",
    "강인한", "우울한", "귀여운", "자유로운", "미지의",
    "신비로운", "소중한", "정신적인", "자연스러운", "끈기 있는",
    "고요한", "고상한", "감사한", "황홀한", "기억에 남는",
    "섬세한", "미묘한", "관심 있는", "참된", "매력적인",
    "아이디어가 풍부한", "밝은", "만족스러운", "공감할 수 있는", "청량한",
    "무결한", "미래를 보는", "자유분방한", "고마운", "날렵한",
    "열정적인", "열린", "환영받는", "안정된", "만족스러운",
    "감사한", "자유분방한", "흥겨운", "친숙한", "우아한"
    ]

    last_nm = [
    "사자", "호랑이", "표범", "치타", "늑대",
    "여우", "하마", "코끼리", "코뿔소", "기린",
    "원숭이", "고릴라", "치마", "코알라", "캥거루",
    "판다", "고양이", "강아지", "토끼", "햄스터",
    "다람쥐", "고슴도치", "오소리", "팽귄", "북극곰",
    "고래", "상어", "참치", "랍스타", "해마",
    "오리", "거위", "백조", "앵무새", "참새",
    "독수리", "부엉이", "올빼미", "낙타", "악어",
    "카멜레온", "하이에나", "바다거북", "갈매기", "물개",
    "멧돼지", "라마", "순록", "사슴", "쿼카",
    "북극여우", "바다표범", "날다람쥐", "오랑우탄", "나무늘보",
    "쥐", "고라니", "수달", "두더지", "비버"
    ]
    
    return random.choice(fir_nm) + random.choice(last_nm)


#email: https://gr-st-dev.tistory.com/1775
